org/os/linux.org
#+TITLE: Linux Administration
#+KEYWORDS: linux, operating, administration
#+OPTIONS: H:3 toc:2 num:3 ^:nil
#+LANGUAGE: en-US
#+AUTHOR: ChrisChen
#+EMAIL: ChrisChen3121@gmail.com
#+SETUPFILE: ../../org-templates/level-1.org
* findutils
** ~which~
** ~whereis~
   searches a broader range of system directories and is independent of your shell’s search path
** ~locate~
   consults a precompiled index of the filesystem to locate file

* Help
** man
   #+BEGIN_SRC shell
     man -k regexp
     man -f command # list all sections
   #+END_SRC

*** ~manpath~
    Use ~manpath~ to see locations of the man files

* Booting
  1. Loading BIOS/UEFI from NVRAM
  1. Probe for hardware
  1. Select boot device(disk, network,...)
  1. Identify EFI system partition
  1. Load boot loader(e.g. GRUB)
  1. Determine which kernel to boot
  1. Load kernel
  1. Instantiate kernel data structures
  1. Start init/systemd as PID 1
  1. Execute startup scripts
  1. Running system

** BIOS vs. UEFI
*** Legacy BIOS(Basic Input/Output System)
    BIOS assumes that the boot device starts with a record called the MBR.
    MBR reads and executes the second-stage boot loader(volume boot record)

*** UFEI(Unified Extensible Firmware Interface)
    The UEFI specification includes a modern disk partitioning scheme known as GPT(GUID Partition Table).

** GRUB 2
*** config
    - /etc/default/grub
    - /etc/grub.d/40_custom
    - /boot/grub/grub.cfg

      Use *grub-mkconfig* to generate grub.cfg, *update-grub* stub for *grub-mkconfig* on Ubuntu

** init
*** modes
**** Single-user mode
     in which only a minimal set of filesystems is mounted, no services
     are running, and a root shell is started on the console.
**** Multiuser mode
     in which all customary filesystems are mounted and all configured
     network services have been started, along with a window system and graphical login
     manager for the console
**** Server mode
     similar to multiuser mode, but with no GUI running on the console
*** Implementations
**** "traditional *init*" from AT&T’s System V UNIX
     system modes are known as "run levels"
**** BSD *init*
**** *systemd* for linux
**** *launchd* for macOS
**** *Upstart* for ubuntu
** systemd
*** *unit* file
    #+BEGIN_SRC systemd
      [Unit]
      Description=fast remote file copy program daemon
      ConditionPathExists=/etc/rsyncd.conf

      [Service]
      ExecStart=/usr/bin/rsync --daemon --no-detach

      [Install]
      WantedBy=multi-user.target
    #+END_SRC
    unit directory: */usr/lib/systemd/system* or */lib/systemd/system*.
    */run/systemd/system* that’s a scratch area for transient units.

*** systemctl
