os/linux.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en-US" xml:lang="en-US">
<head>
<!-- 2020-06-09 Tue 16:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Linux Administration</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ChrisChen" />
<meta name="keywords" content="linux, operating, administration" />
<link rel="stylesheet" type="text/css" href="../styles/demo/css/demo.css"/>
<link href="https://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">Linux Administration</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgebdda60">1. findutils</a>
<ul>
<li><a href="#orgd7446e3">1.1. <code>which</code></a></li>
<li><a href="#org8eb3637">1.2. <code>whereis</code></a></li>
<li><a href="#org036c2f2">1.3. <code>locate</code></a></li>
</ul>
</li>
<li><a href="#orgd96ff01">2. Help</a>
<ul>
<li><a href="#org6ee6d89">2.1. man</a></li>
</ul>
</li>
<li><a href="#org0b1e460">3. Booting</a>
<ul>
<li><a href="#orgeaf958e">3.1. BIOS vs. UEFI</a></li>
<li><a href="#org09c8241">3.2. GRUB 2</a></li>
<li><a href="#org64aabb6">3.3. init</a></li>
<li><a href="#org56de55e">3.4. systemd</a></li>
<li><a href="#orgd58d909">3.5. shutdown</a></li>
</ul>
</li>
<li><a href="#org73a2660">4. Access Control</a>
<ul>
<li><a href="#orga4d217c">4.1. /etc/passwd</a></li>
<li><a href="#orgd27fb98">4.2. /etc/shadow</a></li>
<li><a href="#org74f0f4f">4.3. /etc/group</a></li>
<li><a href="#orge4bf7cf">4.4. /etc/sudoers</a></li>
<li><a href="#org4ad4e08">4.5. users basic</a></li>
<li><a href="#org95cfbb1">4.6. <b>useradd</b> command</a></li>
<li><a href="#org33be0da">4.7. Disabling logins</a></li>
<li><a href="#org64e3ca8">4.8. Centralizing account management</a></li>
<li><a href="#org3e8fbd2">4.9. Authentication</a></li>
<li><a href="#orgaa13b7b">4.10. Modern Access Control</a></li>
</ul>
</li>
<li><a href="#org08098fc">5. Process Control</a>
<ul>
<li><a href="#org84e91fe">5.1. kernel related data in memory</a></li>
<li><a href="#org34acaf3">5.2. Signals</a></li>
<li><a href="#orgdc81bd0">5.3. <b>kill</b></a></li>
<li><a href="#org0237358">5.4. <b>ps</b></a></li>
<li><a href="#org63fb13c">5.5. <b>pstree</b></a></li>
<li><a href="#orgab3d662">5.6. <b>pidstat</b></a></li>
<li><a href="#orgcbac237">5.7. <b>top</b></a></li>
<li><a href="#org99e9a4f">5.8. <b>nice</b></a></li>
<li><a href="#org1af3f19">5.9. <b>execsnoop</b></a></li>
<li><a href="#orgeabde52">5.10. <code>/proc</code></a></li>
<li><a href="#orge425ecf">5.11. *strace*(lower level)</a></li>
<li><a href="#org64354db">5.12. load average</a></li>
<li><a href="#org15852a6">5.13. identify processes using files or sockets</a></li>
<li><a href="#org7b1070d">5.14. periodic processes</a></li>
<li><a href="#org69dff71">5.15. process state</a></li>
</ul>
</li>
<li><a href="#orgd1bac00">6. Filesystem</a>
<ul>
<li><a href="#org3dbc46d">6.1. mount</a></li>
<li><a href="#orgfd11bba">6.2. mounting</a></li>
<li><a href="#org2c81e12">6.3. File type</a></li>
<li><a href="#orgbd22e03">6.4. Important Directories</a></li>
<li><a href="#org6b9cd14">6.5. interesting files</a></li>
</ul>
</li>
<li><a href="#orgd28a46e">7. NFS</a></li>
<li><a href="#org1ed2d69">8. LDAP</a>
<ul>
<li><a href="#orgcd1ba77">8.1. openldap</a></li>
<li><a href="#orga8353a2">8.2. 389 Directory Server</a></li>
<li><a href="#org0f6f95b">8.3. phpLDAPadmin</a></li>
<li><a href="#orga34d09d">8.4. ldapsearch</a></li>
</ul>
</li>
<li><a href="#org51d05e8">9. Networking</a>
<ul>
<li><a href="#org0e61899">9.1. Troubleshooting</a></li>
</ul>
</li>
<li><a href="#org6805865">10. Text Processing</a>
<ul>
<li><a href="#orge2a1748">10.1. grep</a></li>
</ul>
</li>
<li><a href="#orgb461ffa">11. Useful Command</a>
<ul>
<li><a href="#org22be06f">11.1. os</a></li>
<li><a href="#orgabef194">11.2. File System</a></li>
<li><a href="#orgf0cf0ea">11.3. Command Related</a></li>
<li><a href="#orgf498816">11.4. Redirection</a></li>
<li><a href="#orgca250fb">11.5. Expansion</a></li>
</ul>
</li>
<li><a href="#orga2bbf7a">12. Writing Script</a>
<ul>
<li><a href="#orgb58464c">12.1. set</a></li>
<li><a href="#org3478c89">12.2. variables</a></li>
<li><a href="#org266f91f">12.3. arguments</a></li>
<li><a href="#org0d46ddd">12.4. comparison</a></li>
<li><a href="#orgc43f8db">12.5. command currying</a></li>
<li><a href="#org11aa8f4">12.6. loop</a></li>
<li><a href="#org5c9d336">12.7. show usage</a></li>
<li><a href="#org338138b">12.8. quotes</a></li>
<li><a href="#orga6dce19">12.9. an example</a></li>
<li><a href="#orgd4760ac">12.10. args</a></li>
<li><a href="#org43a0521">12.11. Control flow</a></li>
</ul>
</li>
<li><a href="#org10752d2">13. Profiler</a>
<ul>
<li><a href="#orgacdb6b1">13.1. Performance Tools</a></li>
<li><a href="#org68486c4">13.2. Hardware Info</a></li>
<li><a href="#org4900ad6">13.3. CPU</a></li>
<li><a href="#org6d1621c">13.4. Memory</a></li>
<li><a href="#org9c5e132">13.5. Disk IO</a></li>
<li><a href="#org2d34933">13.6. Web Profiler</a></li>
<li><a href="#orge7098a9">13.7. Stress Test</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgebdda60" class="outline-2">
<h2 id="orgebdda60"><span class="section-number-2">1</span> findutils</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgd7446e3" class="outline-3">
<h3 id="orgd7446e3"><span class="section-number-3">1.1</span> <code>which</code></h3>
</div>
<div id="outline-container-org8eb3637" class="outline-3">
<h3 id="org8eb3637"><span class="section-number-3">1.2</span> <code>whereis</code></h3>
<div class="outline-text-3" id="text-1-2">
<p>
searches a broader range of system directories and is independent of your shell’s search path
</p>
</div>
</div>
<div id="outline-container-org036c2f2" class="outline-3">
<h3 id="org036c2f2"><span class="section-number-3">1.3</span> <code>locate</code></h3>
<div class="outline-text-3" id="text-1-3">
<p>
consults a precompiled index of the filesystem to locate file
</p>
</div>
</div>
</div>

<div id="outline-container-orgd96ff01" class="outline-2">
<h2 id="orgd96ff01"><span class="section-number-2">2</span> Help</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org6ee6d89" class="outline-3">
<h3 id="org6ee6d89"><span class="section-number-3">2.1</span> man</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-shell">man -k regexp
man -f command <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">list all sections</span>
</pre>
</div>
</div>

<div id="outline-container-orgdaac4f5" class="outline-4">
<h4 id="orgdaac4f5"><span class="section-number-4">2.1.1</span> <code>manpath</code></h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
Use <code>manpath</code> to see locations of the man files
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org0b1e460" class="outline-2">
<h2 id="org0b1e460"><span class="section-number-2">3</span> Booting</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>Loading BIOS/UEFI from NVRAM</li>
<li>Probe for hardware</li>
<li>Select boot device(disk, network,&#x2026;)</li>
<li>Identify EFI system partition</li>
<li>Load boot loader(e.g. GRUB)</li>
<li>Determine which kernel to boot</li>
<li>Load kernel</li>
<li>Instantiate kernel data structures</li>
<li>Start init/systemd as PID 1</li>
<li>Execute startup scripts</li>
<li>Running system</li>
</ol>
</div>

<div id="outline-container-orgeaf958e" class="outline-3">
<h3 id="orgeaf958e"><span class="section-number-3">3.1</span> BIOS vs. UEFI</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-org30131ba" class="outline-4">
<h4 id="org30131ba"><span class="section-number-4">3.1.1</span> Legacy BIOS(Basic Input/Output System)</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
BIOS assumes that the boot device starts with a record called the MBR.
MBR reads and executes the second-stage boot loader(volume boot record)
</p>
</div>
</div>

<div id="outline-container-org733af2d" class="outline-4">
<h4 id="org733af2d"><span class="section-number-4">3.1.2</span> UFEI(Unified Extensible Firmware Interface)</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
The UEFI specification includes a modern disk partitioning scheme known as GPT(GUID Partition Table).
</p>
</div>
</div>
</div>

<div id="outline-container-org09c8241" class="outline-3">
<h3 id="org09c8241"><span class="section-number-3">3.2</span> GRUB 2</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-org0660120" class="outline-4">
<h4 id="org0660120"><span class="section-number-4">3.2.1</span> config</h4>
<div class="outline-text-4" id="text-3-2-1">
<ul class="org-ul">
<li>/etc/default/grub</li>
<li>/etc/grub.d/40_custom</li>
<li><p>
/boot/grub/grub.cfg
</p>

<p>
Use <b>grub-mkconfig</b> to generate grub.cfg, <b>update-grub</b> stub for <b>grub-mkconfig</b> on Ubuntu
</p></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org64aabb6" class="outline-3">
<h3 id="org64aabb6"><span class="section-number-3">3.3</span> init</h3>
<div class="outline-text-3" id="text-3-3">
</div>
<div id="outline-container-org1682614" class="outline-4">
<h4 id="org1682614"><span class="section-number-4">3.3.1</span> modes</h4>
<div class="outline-text-4" id="text-3-3-1">
</div>
<ul class="org-ul">
<li><a id="orgea8bacc"></a>Single-user mode<br />
<div class="outline-text-5" id="text-orgea8bacc">
<p>
in which only a minimal set of filesystems is mounted, no services
are running, and a root shell is started on the console.
</p>
</div>
</li>
<li><a id="org33214fc"></a>Multiuser mode<br />
<div class="outline-text-5" id="text-org33214fc">
<p>
in which all customary filesystems are mounted and all configured
network services have been started, along with a window system and graphical login
manager for the console
</p>
</div>
</li>
<li><a id="org3893fe6"></a>Server mode<br />
<div class="outline-text-5" id="text-org3893fe6">
<p>
similar to multiuser mode, but with no GUI running on the console
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-org2ccd1b2" class="outline-4">
<h4 id="org2ccd1b2"><span class="section-number-4">3.3.2</span> Implementations</h4>
<div class="outline-text-4" id="text-3-3-2">
</div>
<ul class="org-ul">
<li><a id="orgd8d1664"></a>"traditional <b>init</b>" from AT&amp;T’s System V UNIX<br />
<div class="outline-text-5" id="text-orgd8d1664">
<p>
system modes are known as "run levels"
</p>
</div>
</li>
<li><a id="orgbb5d292"></a>BSD <b>init</b><br /></li>
<li><a id="orgcf20a43"></a><b>systemd</b> for linux<br /></li>
<li><a id="org5535d5e"></a><b>launchd</b> for macOS<br /></li>
<li><a id="org04bbd43"></a><b>Upstart</b> for ubuntu<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org56de55e" class="outline-3">
<h3 id="org56de55e"><span class="section-number-3">3.4</span> systemd</h3>
<div class="outline-text-3" id="text-3-4">
</div>
<div id="outline-container-org21f4ea8" class="outline-4">
<h4 id="org21f4ea8"><span class="section-number-4">3.4.1</span> <b>unit</b> file</h4>
<div class="outline-text-4" id="text-3-4-1">
<div class="org-src-container">
<pre class="src src-systemd">[Unit]
Description=fast remote file copy program daemon
ConditionPathExists=/etc/rsyncd.conf

[Service]
ExecStart=/usr/bin/rsync --daemon --no-detach

[Install]
WantedBy=multi-user.target
</pre>
</div>
<p>
unit directory: <b>/usr/lib/systemd/system</b> or <b>/lib/systemd/system</b>.
<b>/run/systemd/system</b> that’s a scratch area for transient units.
</p>
</div>
</div>
