org/os/linux.org
**** Subcommands
     | Subcommand                | Function                                           |
     |---------------------------+----------------------------------------------------|
     | list-unit-files [pattern] | Shows installed units; optionally matching pattern |
     | enable /unit/             | Enables /unit/ to activate at boot                 |
     | disable /unit/            | Prevents /unit/ from to activate at boot           |
     | isolate /target/          | Changes operating mode to target                   |
     | start /unit/              |                                                    |
     | stop /unit/               |                                                    |
     | restart /unit/            |                                                    |
     | status /unit/             |                                                    |
     | kill /pattern/            | Sends a signal to units matching /pattern/         |
     | daemon-reload             | Reloads unit files and *systemd* configuration     |
     | list-units                |                                                    |

**** States
     | State    | Meaning                                                        |
     |----------+----------------------------------------------------------------|
     | bad      | Smoe kind of problem within *systemd*; usually a bad unit file |
     | disabled | Present, but not configured to start autonomously              |
     | enabled  | Installed and runnable; will start autonomously                |
     | indirect | Disabled, but has peers in Also clauses that may be enabled    |
     | linked   | Unit file available through a symlink                          |
     | masked   | Banished from the *systemd* world from a logical perspective   |
     | static   | Depended upon by another unit; has no install requirements     |

**** Targets
     Target is a group of Units
     #+CAPTION: Mapping between init run levels and systemd targets
     |    Run level | Target            | Description                            |
     |--------------+-------------------+----------------------------------------|
     |            0 | poweroff.target   | System halt                            |
     |    emergency | emergency.target  | Bare-bones shell for system recovery   |
     | 1, s, single | rescue.target     | Single-user mode                       |
     |            2 | multi-user.target | Multiuser mode(command line)           |
     |            3 | multi-user.target | Multiuser mode with networking         |
     |            4 | multi-user.target | Not normally used by *init*            |
     |            5 | graphical.target  | Multiuser mode with networking and GUI |
     |            6 | reboot.target     | System reboot                          |
     To change current operating mode, use *systemctl isolate*, like *telinit* for *init*.
     *systemctl get-default* see the target the system boots into by default. *set-default* to set default.

*** Dependencies
    #+CAPTION: Explict dependencies in the [Unit] section
    | Option    | Meaning                                                                  |
    |-----------+--------------------------------------------------------------------------|
    | Wants     | Units that should be coactivated if possible, but are not required       |
    | Requires  | Strict dependencies; failure of any prerequisite terminates this service |
    | Requisite | Like Requires, but must already be active                                |
    | BindsTo   | Similar to Requires, but even more tightly coupled                       |
    | PartOf    | Similar to Requires, but affects only starting and stopping              |
    | Conflicts | Negative dependencies; cannot be coactive with these units               |
    Use systemctl *add-wants* or *add-requires* to specify a dependency.
    Or add option *WantedBy* or *RequiredBy* to [Install] section.

*** Execution order
    Use Before/After clauses from the unit files to sort the work list.

*** a more complex example
    #+BEGIN_SRC systemd
      [Unit]
      Description=The nginx HTTP and reverse proxy server
      After=network.target remote-fs.target nss-lookup.target

      [Service]
      Type=forking
      PIDFile=/run/nginx.pid
      ExecStartPre=/usr/bin/rm -f /run/nginx.pid
      ExecStartPre=/usr/sbin/nginx -t
      ExecStart=/usr/sbin/nginx
      ExecReload=/bin/kill -s HUP $MAINPID
      KillMode=process
      KillSignal=SIGQUIT
      TimeoutStopSec=5
      PrivateTmp=true

      [Install]
      WantedBy=multi-user.target
    #+END_SRC

*** useful man to write unit file
    - *man systemd.service* to see complete list of options for service
    - *man systemd.unit* to see common options for all types

*** customizations
    Add *conf* file to */etc/systemd/system/xxx.service.d* directory.
    - easy way:
    #+BEGIN_SRC shell
      systemctl edit xxx.service
      systemctl restart xxx.service
    #+END_SRC

*** logging
    System messages captured by *journald* are stored in the */run* directory.

    *rsyslog* can process these messages and store then in traditional log files or
    forward them to a remote syslog server.

    *journalctl* displays log entries. *-u* to specify which service to display.

*** Utilities
    - systemctl
    - systemd-analyze
    - hostnamectl
    - localectl
    - timedatectl
    - loginctl
    - networkctl

** shutdown
*** *halt*
    Performs the essential duties required for shutting down the system
*** *reboot*
    Essentially identical to halt, but it causes the machine to reboot instead of halting
