os/linux.html

<div id="outline-container-org645407c" class="outline-4">
<h4 id="org645407c"><span class="section-number-4">3.4.2</span> systemctl</h4>
<div class="outline-text-4" id="text-3-4-2">
</div>
<ul class="org-ul">
<li><a id="org2769071"></a>Subcommands<br />
<div class="outline-text-5" id="text-org2769071">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Subcommand</th>
<th scope="col" class="org-left">Function</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">list-unit-files [pattern]</td>
<td class="org-left">Shows installed units; optionally matching pattern</td>
</tr>

<tr>
<td class="org-left">enable <i>unit</i></td>
<td class="org-left">Enables <i>unit</i> to activate at boot</td>
</tr>

<tr>
<td class="org-left">disable <i>unit</i></td>
<td class="org-left">Prevents <i>unit</i> from to activate at boot</td>
</tr>

<tr>
<td class="org-left">isolate <i>target</i></td>
<td class="org-left">Changes operating mode to target</td>
</tr>

<tr>
<td class="org-left">start <i>unit</i></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">stop <i>unit</i></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">restart <i>unit</i></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">status <i>unit</i></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">kill <i>pattern</i></td>
<td class="org-left">Sends a signal to units matching <i>pattern</i></td>
</tr>

<tr>
<td class="org-left">daemon-reload</td>
<td class="org-left">Reloads unit files and <b>systemd</b> configuration</td>
</tr>

<tr>
<td class="org-left">list-units</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</li>

<li><a id="org9a882b8"></a>States<br />
<div class="outline-text-5" id="text-org9a882b8">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">State</th>
<th scope="col" class="org-left">Meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">bad</td>
<td class="org-left">Smoe kind of problem within <b>systemd</b>; usually a bad unit file</td>
</tr>

<tr>
<td class="org-left">disabled</td>
<td class="org-left">Present, but not configured to start autonomously</td>
</tr>

<tr>
<td class="org-left">enabled</td>
<td class="org-left">Installed and runnable; will start autonomously</td>
</tr>

<tr>
<td class="org-left">indirect</td>
<td class="org-left">Disabled, but has peers in Also clauses that may be enabled</td>
</tr>

<tr>
<td class="org-left">linked</td>
<td class="org-left">Unit file available through a symlink</td>
</tr>

<tr>
<td class="org-left">masked</td>
<td class="org-left">Banished from the <b>systemd</b> world from a logical perspective</td>
</tr>

<tr>
<td class="org-left">static</td>
<td class="org-left">Depended upon by another unit; has no install requirements</td>
</tr>
</tbody>
</table>
</div>
</li>

<li><a id="org86c46a9"></a>Targets<br />
<div class="outline-text-5" id="text-org86c46a9">
<p>
Target is a group of Units
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 1:</span> Mapping between init run levels and systemd targets</caption>

<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Run level</th>
<th scope="col" class="org-left">Target</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-left">poweroff.target</td>
<td class="org-left">System halt</td>
</tr>

<tr>
<td class="org-right">emergency</td>
<td class="org-left">emergency.target</td>
<td class="org-left">Bare-bones shell for system recovery</td>
</tr>

<tr>
<td class="org-right">1, s, single</td>
<td class="org-left">rescue.target</td>
<td class="org-left">Single-user mode</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">multi-user.target</td>
<td class="org-left">Multiuser mode(command line)</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">multi-user.target</td>
<td class="org-left">Multiuser mode with networking</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">multi-user.target</td>
<td class="org-left">Not normally used by <b>init</b></td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">graphical.target</td>
<td class="org-left">Multiuser mode with networking and GUI</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-left">reboot.target</td>
<td class="org-left">System reboot</td>
</tr>
</tbody>
</table>
<p>
To change current operating mode, use <b>systemctl isolate</b>, like <b>telinit</b> for <b>init</b>.
<b>systemctl get-default</b> see the target the system boots into by default. <b>set-default</b> to set default.
</p>
</div>
</li>
</ul>
</div>

<div id="outline-container-orgd1eb36b" class="outline-4">
<h4 id="orgd1eb36b"><span class="section-number-4">3.4.3</span> Dependencies</h4>
<div class="outline-text-4" id="text-3-4-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 2:</span> Explict dependencies in the [Unit] section</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Option</th>
<th scope="col" class="org-left">Meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Wants</td>
<td class="org-left">Units that should be coactivated if possible, but are not required</td>
</tr>

<tr>
<td class="org-left">Requires</td>
<td class="org-left">Strict dependencies; failure of any prerequisite terminates this service</td>
</tr>

<tr>
<td class="org-left">Requisite</td>
<td class="org-left">Like Requires, but must already be active</td>
</tr>

<tr>
<td class="org-left">BindsTo</td>
<td class="org-left">Similar to Requires, but even more tightly coupled</td>
</tr>

<tr>
<td class="org-left">PartOf</td>
<td class="org-left">Similar to Requires, but affects only starting and stopping</td>
</tr>

<tr>
<td class="org-left">Conflicts</td>
<td class="org-left">Negative dependencies; cannot be coactive with these units</td>
</tr>
</tbody>
</table>
<p>
Use systemctl <b>add-wants</b> or <b>add-requires</b> to specify a dependency.
Or add option <b>WantedBy</b> or <b>RequiredBy</b> to [Install] section.
</p>
</div>
</div>

<div id="outline-container-orgd4e8c80" class="outline-4">
<h4 id="orgd4e8c80"><span class="section-number-4">3.4.4</span> Execution order</h4>
<div class="outline-text-4" id="text-3-4-4">
<p>
Use Before/After clauses from the unit files to sort the work list.
</p>
</div>
</div>

<div id="outline-container-org718354c" class="outline-4">
<h4 id="org718354c"><span class="section-number-4">3.4.5</span> a more complex example</h4>
<div class="outline-text-4" id="text-3-4-5">
<div class="org-src-container">
<pre class="src src-systemd">[Unit]
Description=The nginx HTTP and reverse proxy server
After=network.target remote-fs.target nss-lookup.target

[Service]
Type=forking
PIDFile=/run/nginx.pid
ExecStartPre=/usr/bin/rm -f /run/nginx.pid
ExecStartPre=/usr/sbin/nginx -t
ExecStart=/usr/sbin/nginx
ExecReload=/bin/kill -s HUP $MAINPID
KillMode=process
KillSignal=SIGQUIT
TimeoutStopSec=5
PrivateTmp=true

[Install]
WantedBy=multi-user.target
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb14f272" class="outline-4">
<h4 id="orgb14f272"><span class="section-number-4">3.4.6</span> useful man to write unit file</h4>
<div class="outline-text-4" id="text-3-4-6">
<ul class="org-ul">
<li><b>man systemd.service</b> to see complete list of options for service</li>
<li><b>man systemd.unit</b> to see common options for all types</li>
</ul>
</div>
</div>

<div id="outline-container-org6a876f3" class="outline-4">
<h4 id="org6a876f3"><span class="section-number-4">3.4.7</span> customizations</h4>
<div class="outline-text-4" id="text-3-4-7">
<p>
Add <b>conf</b> file to <b>/etc/systemd/system/xxx.service.d</b> directory.
</p>
<ul class="org-ul">
<li>easy way:</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell">systemctl edit xxx.service
systemctl restart xxx.service
</pre>
</div>
</div>
</div>

<div id="outline-container-org66c4e95" class="outline-4">
<h4 id="org66c4e95"><span class="section-number-4">3.4.8</span> logging</h4>
<div class="outline-text-4" id="text-3-4-8">
<p>
System messages captured by <b>journald</b> are stored in the <b>/run</b> directory.
</p>

<p>
<b>rsyslog</b> can process these messages and store then in traditional log files or
forward them to a remote syslog server.
</p>

<p>
<b>journalctl</b> displays log entries. <b>-u</b> to specify which service to display.
</p>
</div>
</div>

<div id="outline-container-org05941ee" class="outline-4">
<h4 id="org05941ee"><span class="section-number-4">3.4.9</span> Utilities</h4>
<div class="outline-text-4" id="text-3-4-9">
<ul class="org-ul">
<li>systemctl</li>
<li>systemd-analyze</li>
<li>hostnamectl</li>
<li>localectl</li>
<li>timedatectl</li>
<li>loginctl</li>
<li>networkctl</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgd58d909" class="outline-3">
<h3 id="orgd58d909"><span class="section-number-3">3.5</span> shutdown</h3>
<div class="outline-text-3" id="text-3-5">
</div>
<div id="outline-container-org6996788" class="outline-4">
<h4 id="org6996788"><span class="section-number-4">3.5.1</span> <b>halt</b></h4>
<div class="outline-text-4" id="text-3-5-1">
<p>
Performs the essential duties required for shutting down the system
</p>
</div>
</div>
<div id="outline-container-org634bcdf" class="outline-4">
<h4 id="org634bcdf"><span class="section-number-4">3.5.2</span> <b>reboot</b></h4>
<div class="outline-text-4" id="text-3-5-2">
<p>
Essentially identical to halt, but it causes the machine to reboot instead of halting
</p>
</div>
</div>
