os/linux.html
<div id="outline-container-org7066a1b" class="outline-4">
<h4 id="org7066a1b"><span class="section-number-4">3.5.3</span> <b>shutdown</b></h4>
<div class="outline-text-4" id="text-3-5-3">
<p>
The shutdown command is a layer over halt and reboot that provides for scheduled shutdowns
and ominous warnings to logged-in users
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org73a2660" class="outline-2">
<h2 id="org73a2660"><span class="section-number-2">4</span> Access Control</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orga4d217c" class="outline-3">
<h3 id="orga4d217c"><span class="section-number-3">4.1</span> /etc/passwd</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-orge00c7d6" class="outline-4">
<h4 id="orge00c7d6"><span class="section-number-4">4.1.1</span> Login name</h4>
</div>
<div id="outline-container-org97354ea" class="outline-4">
<h4 id="org97354ea"><span class="section-number-4">4.1.2</span> Encrypted password placeholder</h4>
<div class="outline-text-4" id="text-4-1-2">
<ul class="org-ul">
<li>actual password in <b>/etc/shadow</b></li>
<li>change password restriction by editing <b>/etc/login.defs</b></li>
</ul>
</div>
</div>
<div id="outline-container-org6c18242" class="outline-4">
<h4 id="org6c18242"><span class="section-number-4">4.1.3</span> UID (user ID) number</h4>
</div>
<div id="outline-container-orgeb8782f" class="outline-4">
<h4 id="orgeb8782f"><span class="section-number-4">4.1.4</span> Default GID (group ID) number</h4>
</div>
<div id="outline-container-org7ff0ffa" class="outline-4">
<h4 id="org7ff0ffa"><span class="section-number-4">4.1.5</span> GECOS information</h4>
<div class="outline-text-4" id="text-4-1-5">
<p>
Use <b>finger</b> command to interpert GECOS, use <b>chfn</b> to change GECOS
</p>
<ul class="org-ul">
<li>full name</li>
<li>office number and building</li>
<li>office telephone extension</li>
<li>home phone number</li>
</ul>
</div>
</div>

<div id="outline-container-orgb2fa9fb" class="outline-4">
<h4 id="orgb2fa9fb"><span class="section-number-4">4.1.6</span> Home directory</h4>
</div>
<div id="outline-container-org42ee1fb" class="outline-4">
<h4 id="org42ee1fb"><span class="section-number-4">4.1.7</span> Login shell</h4>
<div class="outline-text-4" id="text-4-1-7">
<p>
Use <b>chsh</b> to change login shell listed in <b>/etc/shells</b>.
</p>
</div>
</div>
</div>

<div id="outline-container-orgd27fb98" class="outline-3">
<h3 id="orgd27fb98"><span class="section-number-3">4.2</span> /etc/shadow</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>Login name <b>required</b></li>
<li>Encrypted password <b>required</b></li>
<li>Date of last password change</li>
<li>Minimum number of days between changes</li>
<li>Maximum number of days between password changes</li>
<li>Number of days in advance to warn users about password expiration</li>
<li>Linux: Days after password expiration that account is disabled</li>
<li>Account expiration date</li>
<li>A reserved field that is currently always empty</li>
</ul>
</div>
</div>

<div id="outline-container-org74f0f4f" class="outline-3">
<h3 id="org74f0f4f"><span class="section-number-3">4.3</span> /etc/group</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li>Group name</li>
<li>Encrypted password or a placeholder</li>
<li>GID number</li>
<li>List of members, separated by commas</li>
</ul>


<p>
It is possible to enter a group password to allow users not belonging to
a group to enter it with the <b>newgrp</b> command.
</p>

<p>
A password can be set with the <b>gpasswd</b> command
</p>

<p>
A user’s personal group should contain only that user. If you want to let users
share files by way of the group mechanism, create separate groups for that purpose
</p>
</div>
</div>
<div id="outline-container-orge4bf7cf" class="outline-3">
<h3 id="orge4bf7cf"><span class="section-number-3">4.4</span> /etc/sudoers</h3>
<div class="outline-text-3" id="text-4-4">
<div class="org-src-container">
<pre class="src src-shell">mark, ed    <span style="color: #715ab1;">SOME_HOST_ALIAS</span>=ALL
herb    <span style="color: #715ab1;">SOME_HOST_ALIAS</span>=/usr/sbin/tcpdump : !<span style="color: #715ab1;">SOME_HOST_ALIAS</span>=(operator) DUMP
lynda    <span style="color: #715ab1;">ALL</span>=(ALL)ALL, !SOME_CMND_ALIAS
%wheel    ALL, !<span style="color: #715ab1;">SOME_HOST_ALIAS</span> = NOPASSWD: SOME_CMND_ALIAS
</pre>
</div>

<p>
Whitelist the environment variables by adding them to the sudoers file’s env_keep list
</p>
</div>
</div>

<div id="outline-container-org4ad4e08" class="outline-3">
<h3 id="org4ad4e08"><span class="section-number-3">4.5</span> users basic</h3>
<div class="outline-text-3" id="text-4-5">
</div>
<div id="outline-container-org3bc368f" class="outline-4">
<h4 id="org3bc368f"><span class="section-number-4">4.5.1</span> Required</h4>
<div class="outline-text-4" id="text-4-5-1">
</div>
<ul class="org-ul">
<li><a id="org321f378"></a>Sign policy agreement<br /></li>
<li><a id="orgc516304"></a>Edit the <b>passwd</b> and <b>shadow</b> files to define user<br />
<div class="outline-text-5" id="text-orgc516304">
<p>
Use <b>vipw</b> to edit <b>passwd</b> and <b>shadow</b>
</p>
</div>
</li>
<li><a id="org03ddf46"></a>Add the user to the /etc/group file(optional)<br />
<div class="outline-text-5" id="text-org03ddf46">
<p>
If the new user should be a member of more groups than just the default group
specified in the passwd file, you must edit the /etc/group file and add the user’s
login name to each of the additional groups.
</p>
</div>
</li>
<li><a id="org7fbcf3f"></a>Set an initial password<br />
<div class="outline-text-5" id="text-org7fbcf3f">
<p>
Use <b>passwd</b>
</p>
</div>
</li>
<li><a id="org34bf3ac"></a>Create, <b>chown</b>, and <b>chmod</b> the user’s home directory.<br />
<div class="outline-text-5" id="text-org34bf3ac">
<div class="org-src-container">
<pre class="src src-bash">sudo chown -R newuser:newgroup ~newuser
</pre>
</div>
</div>
</li>
<li><a id="org95f6cb1"></a>Configure roles and permissions(RBAC)<br /></li>
</ul>
</div>

<div id="outline-container-org694f11b" class="outline-4">
<h4 id="org694f11b"><span class="section-number-4">4.5.2</span> For the user</h4>
<div class="outline-text-4" id="text-4-5-2">
</div>
<ul class="org-ul">
<li><a id="org2e66936"></a>Copy default startup files to the user’s home directory.<br /></li>
<li><a id="org198e79c"></a>Set the user’s mail home and establish mail aliases.<br /></li>
</ul>
</div>

<div id="outline-container-org4748bb7" class="outline-4">
<h4 id="org4748bb7"><span class="section-number-4">4.5.3</span> For administrator</h4>
<div class="outline-text-4" id="text-4-5-3">
</div>
<ul class="org-ul">
<li><a id="orgffc721b"></a>Verify that the account is set up correctly.<br /></li>
<li><a id="org16ac290"></a>Add the user’s contact information and account status to your database.<br /></li>
</ul>
</div>

<div id="outline-container-orgf46cc8f" class="outline-4">
<h4 id="orgf46cc8f"><span class="section-number-4">4.5.4</span> Verification</h4>
<div class="outline-text-4" id="text-4-5-4">
<div class="org-src-container">
<pre class="src src-bash">$ pwd /* verify home directory */
$ ls -al /* check owner/group of startup files */
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org95cfbb1" class="outline-3">
<h3 id="org95cfbb1"><span class="section-number-3">4.6</span> <b>useradd</b> command</h3>
<div class="outline-text-3" id="text-4-6">
</div>
<div id="outline-container-org143dad9" class="outline-4">
<h4 id="org143dad9"><span class="section-number-4">4.6.1</span> examples</h4>
<div class="outline-text-4" id="text-4-6-1">
<div class="org-src-container">
<pre class="src src-bash">sudo useradd -c <span style="color: #2d9574;">"chrischen"</span> -d /home/chrischen -m -s /bin/zsh chrischen
sudo usermod -aG sudo chrishcen
</pre>
</div>
</div>
</div>
<div id="outline-container-org717d64d" class="outline-4">
<h4 id="org717d64d"><span class="section-number-4">4.6.2</span> ubuntu</h4>
<div class="outline-text-4" id="text-4-6-2">
<p>
Ubuntu provides two ways to add users: <b>adduser</b> and <b>useradd</b>. <b>adduser</b> is a Perl
wrapper for useradd that is a bit more helpful (makes home directories, copies in
startup files, etc.).
</p>
<ul class="org-ul">
<li><b>adduser</b> is configured in <b>/etc/adduser.conf</b></li>
<li><b>adduser</b> has a twin <b>addgroup</b> and cousins <b>deluser</b> and <b>delgroup</b>.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org33be0da" class="outline-3">
<h3 id="org33be0da"><span class="section-number-3">4.7</span> Disabling logins</h3>
<div class="outline-text-3" id="text-4-7">
<ul class="org-ul">
<li><b>usermod -L</b> to lock user</li>
<li><b>usermod -U</b> to unlock user</li>
</ul>
</div>
</div>
<div id="outline-container-org64e3ca8" class="outline-3">
<h3 id="org64e3ca8"><span class="section-number-3">4.8</span> Centralizing account management</h3>
<div class="outline-text-3" id="text-4-8">
</div>
<div id="outline-container-org5ffff8e" class="outline-4">
<h4 id="org5ffff8e"><span class="section-number-4">4.8.1</span> LDAP</h4>
</div>
<div id="outline-container-org0a8629c" class="outline-4">
<h4 id="org0a8629c"><span class="section-number-4">4.8.2</span> Identity management systems</h4>
</div>
</div>
<div id="outline-container-org3e8fbd2" class="outline-3">
<h3 id="org3e8fbd2"><span class="section-number-3">4.9</span> Authentication</h3>
<div class="outline-text-3" id="text-4-9">
</div>
<div id="outline-container-orgdf88613" class="outline-4">
<h4 id="orgdf88613"><span class="section-number-4">4.9.1</span> PAM(Pluggable Authentication Modules)</h4>
<div class="outline-text-4" id="text-4-9-1">
<p>
PAM is a wrapper for a variety of method-specific authentication libraries.
</p>
</div>
</div>
<div id="outline-container-org81b82ad" class="outline-4">
<h4 id="org81b82ad"><span class="section-number-4">4.9.2</span> Kerberos: network cryptographic authentication</h4>
<div class="outline-text-4" id="text-4-9-2">
<p>
PAM is an authentication framework, Kerberos is a specific authentication method,
PAM and Kerberos generally work together
</p>
</div>
</div>
<div id="outline-container-org47ed1e7" class="outline-4">
<h4 id="org47ed1e7"><span class="section-number-4">4.9.3</span> Filesystem ACL</h4>
</div>
<div id="outline-container-org70dadd7" class="outline-4">
<h4 id="org70dadd7"><span class="section-number-4">4.9.4</span> Linux capabilities</h4>
</div>
<div id="outline-container-org1410417" class="outline-4">
<h4 id="org1410417"><span class="section-number-4">4.9.5</span> Linux namespaces</h4>
</div>
</div>
<div id="outline-container-orgaa13b7b" class="outline-3">
<h3 id="orgaa13b7b"><span class="section-number-3">4.10</span> Modern Access Control</h3>
<div class="outline-text-3" id="text-4-10">
</div>
<div id="outline-container-orge9fd00a" class="outline-4">
<h4 id="orge9fd00a"><span class="section-number-4">4.10.1</span> MAC</h4>
</div>
<div id="outline-container-org47f1ad8" class="outline-4">
<h4 id="org47f1ad8"><span class="section-number-4">4.10.2</span> RBAC</h4>
</div>
<div id="outline-container-org4eb073f" class="outline-4">
<h4 id="org4eb073f"><span class="section-number-4">4.10.3</span> Implementations</h4>
<div class="outline-text-4" id="text-4-10-3">
</div>
<ul class="org-ul">
<li><a id="orgd2d5510"></a>AppArmor<br /></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org08098fc" class="outline-2">
<h2 id="org08098fc"><span class="section-number-2">5</span> Process Control</h2>
<div class="outline-text-2" id="text-5">
</div>
