org/os/linux.org
** kernel related data in memory
   - The process’s address space map
   - The current status of the process (sleeping, stopped, runnable, etc.)
   - The execution priority of the process
   - Information about the resources the process has used (CPU, memory, etc.)
   - Information about the files and network ports the process has opened
   - The process’s signal mask (a record of which signals are blocked)
   - The owner of the process

** Signals
   | No | Name  | Description          | Default   | Can catch? | Can block? | Dump core? |
   |----+-------+----------------------+-----------+------------+------------+------------|
   |  1 | HUP   | Hangup               | Terminate | Y          | Y          | N          |
   |  2 | INT   | Interrupt            | Terminate | Y          | Y          | N          |
   |  3 | QUIT  | Quit                 | Terminate | Y          | Y          | Y          |
   |  9 | KILL  | Kill                 | Terminate | N          | N          | N          |
   | 10 | BUS   | Bus error            | Terminate | Y          | Y          | Y          |
   | 11 | SEGV  | Segmentation fault   | Terminate | Y          | Y          | Y          |
   | 15 | TERM  | Software termination | Terminate | Y          | Y          | N          |
   | 17 | STOP  | Stop                 | Stop      | N          | N          | N          |
   | 18 | TSTP  | Keyboard stop        | Stop      | Y          | Y          | N          |
   | 19 | CONT  | Continue after stop  | Ignore    | Y          | N          | N          |
   | 28 | WINCH | Window changed       | Ignore    | Y          | Y          | N          |
   | 30 | USR1  | User-defined #1      | Terminate | Y          | Y          | N          |
   | 31 | USR2  | User-defined #2      | Terminate | Y          | Y          | N          |
   *kill -l* to list signals.

** *kill*
   - killall: kill by process name
   - pkill: search for process to kill

** *ps*
   Useful options
   - aux: *a* show all processes; *x* show processes that don't have a control terminal; *u* user oriented output format
   - lax: faster than aux(UID only), aslo includes PPID, NI(niceness) and wait channel
     - ww: enable unlimited column width

*** with *grep*
    ps -aux | grep -v grep | grep xxxx
*** alternative command
    - *pidof* :: determine the PID of a process
    - *pgrep*

** *top*
   1: show loads of individual cores
   - H: show threads

*** alternative *htop*

** *nice*
   - Niceness range: ~-20~ to ~19~
   - Only root can run a command with high priority
   - *renice*

** =/proc=
   *ps* and *top* read their process status information from the =/proc= directory
*** useful process files
    cgroups, cmd, cmdline, cwd, environ, exe, fdinfo, ns, root, stat, statm
    - fd :: reperents open files
    - maps :: libraries dependencies

** *strace*(lower level)
   Display every system call that a process makes and every signal it receives
   - ~-f~ to trace sub processes

** load average
   - *uptime*: load average of 1-, 5-, 15-minute intervals(cpu&io)

** identify processes using files or sockets
   - *fuser*
   - *lsof*: list open files

** periodic processes
   - crontab
   - systemd timer

* Filesystem
** mount
   1. ~mkfs.type~
   1. ~mount -t type /dev/sda [mountpoint]~
   - ~umount [mountpoint]~

** mounting
   - =/etc/fstab= :: lists filesystems that are normally mounted on the system.
   - *fuser -c mountpoint* :: prints the PID of every process that’s using a file or directory on that filesystem. uses *-v* to display command name
   - *lsof* ::  alternative to *fusr*, *-F* for easy parsing

