os/linux.html
<div id="outline-container-org84e91fe" class="outline-3">
<h3 id="org84e91fe"><span class="section-number-3">5.1</span> kernel related data in memory</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li>The process’s address space map</li>
<li>The current status of the process (sleeping, stopped, runnable, etc.)</li>
<li>The execution priority of the process</li>
<li>Information about the resources the process has used (CPU, memory, etc.)</li>
<li>Information about the files and network ports the process has opened</li>
<li>The process’s signal mask (a record of which signals are blocked)</li>
<li>The owner of the process</li>
</ul>
</div>
</div>

<div id="outline-container-org34acaf3" class="outline-3">
<h3 id="org34acaf3"><span class="section-number-3">5.2</span> Signals</h3>
<div class="outline-text-3" id="text-5-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">No</th>
<th scope="col" class="org-left">Name</th>
<th scope="col" class="org-left">Description</th>
<th scope="col" class="org-left">Default</th>
<th scope="col" class="org-left">Can catch?</th>
<th scope="col" class="org-left">Can block?</th>
<th scope="col" class="org-left">Dump core?</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">HUP</td>
<td class="org-left">Hangup</td>
<td class="org-left">Terminate</td>
<td class="org-left">Y</td>
<td class="org-left">Y</td>
<td class="org-left">N</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">INT</td>
<td class="org-left">Interrupt</td>
<td class="org-left">Terminate</td>
<td class="org-left">Y</td>
<td class="org-left">Y</td>
<td class="org-left">N</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">QUIT</td>
<td class="org-left">Quit</td>
<td class="org-left">Terminate</td>
<td class="org-left">Y</td>
<td class="org-left">Y</td>
<td class="org-left">Y</td>
</tr>

<tr>
<td class="org-right">9</td>
<td class="org-left">KILL</td>
<td class="org-left">Kill</td>
<td class="org-left">Terminate</td>
<td class="org-left">N</td>
<td class="org-left">N</td>
<td class="org-left">N</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-left">BUS</td>
<td class="org-left">Bus error</td>
<td class="org-left">Terminate</td>
<td class="org-left">Y</td>
<td class="org-left">Y</td>
<td class="org-left">Y</td>
</tr>

<tr>
<td class="org-right">11</td>
<td class="org-left">SEGV</td>
<td class="org-left">Segmentation fault</td>
<td class="org-left">Terminate</td>
<td class="org-left">Y</td>
<td class="org-left">Y</td>
<td class="org-left">Y</td>
</tr>

<tr>
<td class="org-right">15</td>
<td class="org-left">TERM</td>
<td class="org-left">Software termination</td>
<td class="org-left">Terminate</td>
<td class="org-left">Y</td>
<td class="org-left">Y</td>
<td class="org-left">N</td>
</tr>

<tr>
<td class="org-right">17</td>
<td class="org-left">STOP</td>
<td class="org-left">Stop</td>
<td class="org-left">Stop</td>
<td class="org-left">N</td>
<td class="org-left">N</td>
<td class="org-left">N</td>
</tr>

<tr>
<td class="org-right">18</td>
<td class="org-left">TSTP</td>
<td class="org-left">Keyboard stop</td>
<td class="org-left">Stop</td>
<td class="org-left">Y</td>
<td class="org-left">Y</td>
<td class="org-left">N</td>
</tr>

<tr>
<td class="org-right">19</td>
<td class="org-left">CONT</td>
<td class="org-left">Continue after stop</td>
<td class="org-left">Ignore</td>
<td class="org-left">Y</td>
<td class="org-left">N</td>
<td class="org-left">N</td>
</tr>

<tr>
<td class="org-right">28</td>
<td class="org-left">WINCH</td>
<td class="org-left">Window changed</td>
<td class="org-left">Ignore</td>
<td class="org-left">Y</td>
<td class="org-left">Y</td>
<td class="org-left">N</td>
</tr>

<tr>
<td class="org-right">30</td>
<td class="org-left">USR1</td>
<td class="org-left">User-defined #1</td>
<td class="org-left">Terminate</td>
<td class="org-left">Y</td>
<td class="org-left">Y</td>
<td class="org-left">N</td>
</tr>

<tr>
<td class="org-right">31</td>
<td class="org-left">USR2</td>
<td class="org-left">User-defined #2</td>
<td class="org-left">Terminate</td>
<td class="org-left">Y</td>
<td class="org-left">Y</td>
<td class="org-left">N</td>
</tr>
</tbody>
</table>
<p>
<b>kill -l</b> to list signals.
</p>
</div>
</div>

<div id="outline-container-orgdc81bd0" class="outline-3">
<h3 id="orgdc81bd0"><span class="section-number-3">5.3</span> <b>kill</b></h3>
<div class="outline-text-3" id="text-5-3">
<ul class="org-ul">
<li>killall: kill by process name</li>
<li>pkill: search for process to kill</li>
</ul>
</div>
</div>

<div id="outline-container-org0237358" class="outline-3">
<h3 id="org0237358"><span class="section-number-3">5.4</span> <b>ps</b></h3>
<div class="outline-text-3" id="text-5-4">
<p>
Useful options
</p>
<ul class="org-ul">
<li>aux: <b>a</b> show all processes; <b>x</b> show processes that don't have a control terminal; <b>u</b> user oriented output format</li>
<li>lax: faster than aux(UID only), aslo includes PPID, NI(niceness) and wait channel
<ul class="org-ul">
<li>ww: enable unlimited column width</li>
</ul></li>
</ul>
</div>

<div id="outline-container-org493274b" class="outline-4">
<h4 id="org493274b"><span class="section-number-4">5.4.1</span> with <b>grep</b></h4>
<div class="outline-text-4" id="text-5-4-1">
<p>
ps -aux | grep -v grep | grep xxxx
</p>
</div>
</div>
<div id="outline-container-org838faee" class="outline-4">
<h4 id="org838faee"><span class="section-number-4">5.4.2</span> alternative command</h4>
<div class="outline-text-4" id="text-5-4-2">
<dl class="org-dl">
<dt><b>pidof</b></dt><dd>determine the PID of a process</dd>
<dt>(no term)</dt><dd><b>pgrep</b></dd>
</dl>
</div>
</div>
</div>

<div id="outline-container-org63fb13c" class="outline-3">
<h3 id="org63fb13c"><span class="section-number-3">5.5</span> <b>pstree</b></h3>
</div>
<div id="outline-container-orgab3d662" class="outline-3">
<h3 id="orgab3d662"><span class="section-number-3">5.6</span> <b>pidstat</b></h3>
<div class="outline-text-3" id="text-5-6">
<div class="org-src-container">
<pre class="src src-bash">pidstat -d -p PID 1 3
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcbac237" class="outline-3">
<h3 id="orgcbac237"><span class="section-number-3">5.7</span> <b>top</b></h3>
<div class="outline-text-3" id="text-5-7">
<p>
1: show loads of individual cores
</p>
<ul class="org-ul">
<li>H: show threads</li>
</ul>
</div>

<div id="outline-container-org33d250c" class="outline-4">
<h4 id="org33d250c"><span class="section-number-4">5.7.1</span> alternative <b>htop</b></h4>
</div>
</div>

<div id="outline-container-org99e9a4f" class="outline-3">
<h3 id="org99e9a4f"><span class="section-number-3">5.8</span> <b>nice</b></h3>
<div class="outline-text-3" id="text-5-8">
<ul class="org-ul">
<li>Niceness range: <code>-20</code> to <code>19</code></li>
<li>Only root can run a command with high priority</li>
<li><b>renice</b></li>
</ul>
</div>
</div>

<div id="outline-container-org1af3f19" class="outline-3">
<h3 id="org1af3f19"><span class="section-number-3">5.9</span> <b>execsnoop</b></h3>
</div>
<div id="outline-container-orgeabde52" class="outline-3">
<h3 id="orgeabde52"><span class="section-number-3">5.10</span> <code>/proc</code></h3>
<div class="outline-text-3" id="text-5-10">
<p>
<b>ps</b> and <b>top</b> read their process status information from the <code>/proc</code> directory
</p>
</div>
<div id="outline-container-org6f5b927" class="outline-4">
<h4 id="org6f5b927"><span class="section-number-4">5.10.1</span> useful process files</h4>
<div class="outline-text-4" id="text-5-10-1">
<p>
cgroups, cmd, cmdline, cwd, environ, exe, fdinfo, ns, root, stat, statm
</p>
<dl class="org-dl">
<dt>fd</dt><dd>reperents open files</dd>
<dt>maps</dt><dd>libraries dependencies</dd>
</dl>
</div>
</div>
</div>

<div id="outline-container-orge425ecf" class="outline-3">
<h3 id="orge425ecf"><span class="section-number-3">5.11</span> *strace*(lower level)</h3>
<div class="outline-text-3" id="text-5-11">
<p>
Display every system call that a process makes and every signal it receives
</p>
<ul class="org-ul">
<li><code>-f</code> to trace sub processes</li>
</ul>
</div>
</div>

<div id="outline-container-org64354db" class="outline-3">
<h3 id="org64354db"><span class="section-number-3">5.12</span> load average</h3>
<div class="outline-text-3" id="text-5-12">
<ul class="org-ul">
<li><b>uptime</b>: load average of 1-, 5-, 15-minute intervals(cpu&amp;io)</li>
</ul>
</div>
</div>

<div id="outline-container-org15852a6" class="outline-3">
<h3 id="org15852a6"><span class="section-number-3">5.13</span> identify processes using files or sockets</h3>
<div class="outline-text-3" id="text-5-13">
<ul class="org-ul">
<li><b>fuser</b></li>
<li><b>lsof</b>: list open files</li>
</ul>
</div>
</div>

<div id="outline-container-org7b1070d" class="outline-3">
<h3 id="org7b1070d"><span class="section-number-3">5.14</span> periodic processes</h3>
<div class="outline-text-3" id="text-5-14">
<ul class="org-ul">
<li>crontab</li>
<li>systemd timer</li>
</ul>
</div>
</div>

<div id="outline-container-org69dff71" class="outline-3">
<h3 id="org69dff71"><span class="section-number-3">5.15</span> process state</h3>
<div class="outline-text-3" id="text-5-15">
<ul class="org-ul">
<li>R: Running/Runnable</li>
<li>D: Disk Sleep (Uninterruptible Sleep)</li>
<li>Z: Zombie</li>
<li>S: Interruptible Sleep</li>
<li>I: Idle</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgd1bac00" class="outline-2">
<h2 id="orgd1bac00"><span class="section-number-2">6</span> Filesystem</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org3dbc46d" class="outline-3">
<h3 id="org3dbc46d"><span class="section-number-3">6.1</span> mount</h3>
<div class="outline-text-3" id="text-6-1">
<ol class="org-ol">
<li><code>mkfs.type</code></li>
<li><code>mount -t type /dev/sda [mountpoint]</code></li>
<li><code>umount [mountpoint]</code></li>
</ol>
</div>
</div>

<div id="outline-container-orgfd11bba" class="outline-3">
<h3 id="orgfd11bba"><span class="section-number-3">6.2</span> mounting</h3>
<div class="outline-text-3" id="text-6-2">
<dl class="org-dl">
<dt><code>/etc/fstab</code></dt><dd>lists filesystems that are normally mounted on the system.</dd>
<dt><b>fuser -c mountpoint</b></dt><dd>prints the PID of every process that’s using a file or directory on that filesystem. uses <b>-v</b> to display command name</dd>
<dt><b>lsof</b></dt><dd>alternative to <b>fusr</b>, <b>-F</b> for easy parsing</dd>
</dl>
</div>
</div>
