org/os/linux.org
** File type
   - investigating file type: ~file~ or ~ls~
     | Symbol | Type                  | Created by |
     |--------+-----------------------+------------|
     | -      | regular file          | editors    |
     | d      | directory             | ~mkdir~    |
     | c      | character device file | ~mknod~    |
     | b      | block device file     | ~mknod~    |
     | s      | domain socket         |            |
     | p      | named pipe            | ~mknod~    |
     | l      | symbolic link         | ~ln -s~    |

** Important Directories
   - ~man hier~
  | =/bin=           | Contains binaries (programs) that must be present for the system to boot and run.                                                                                       |
  | =/boot=          | Contains the Linux kernel, initial RAM disk image, and the boot loader.                                                                                                 |
  | =/dev=           | This is a special directory that contains device nodes.                                                                                                                 |
  | =/etc=           | Contains all of the system-wide configuration files.                                                                                                                    |
  | =/home=          |                                                                                                                                                                         |
  | =/lib=           | Contains shared library files used by the core system programs.                                                                                                         |
  | =/lost+found=    | It is used in the case of a partial recovery from a filesystem corruption event.                                                                                        |
  | =/media=         | Contain the mount points for removable media such as USB drives, CD-ROMs, etc.                                                                                          |
  | =/opt=           | The =/opt= directory is used to install "optional" software. This is mainly used to hold commercial software products that may be installed on your system.             |
  | =/proc=          | It is a virtual filesystem maintained by the Linux kernel. The files are readable and will give you a picture of how the kernel sees your computer.                     |
  | =/root=          | This is the home directory for the root account.                                                                                                                        |
  | =/sbin=          | This directory contains 'system' binaries. These are programs that perform vital system tasks that are generally reserved for the superuser.                            |
  | =/tmp=           | The =/tmp= directory is intended for storage of temporary, transient files created by various programs.                                                                 |
  | =/usr=           | The =/usr= directory tree is likely the largest one on a Linux system. It contains all the programs and support files used by regular users.                            |
  | =/usr/bin=       | Contains the executable programs installed by your Linux distribution                                                                                                   |
  | =/usr/lib=       | The shared libraries for the programs in =/usr/bin=.                                                                                                                    |
  | =/usr/local=     | The =/usr/local= tree is where programs that are not included with your distribution but are intended for system-wide use are installed.                                |
  | =/usr/sbin=      | Contains more system administration programs.                                                                                                                           |
  | =/usr/share=     | Contains all the shared data used by programs in =/usr/bin=.                                                                                                            |
  | =/usr/share/doc= | Most packages installed on the system will include some kind of documentation.                                                                                          |
  | =/var=           | The =/var= directory tree is where data that is likely to change is stored. Various databases, spool files, user mail, etc. are located here.                           |
  | =/var/log=       | Contains log files, records of various system activity. These are very important and should be monitored from time to time. The most useful one is =/var/log/messages=. |

** interesting files
  - =/boot/grub/grub.cfg=, which are used to configure the boot loader
  - =/boot/vmlinuz=, the Linux kernel
  - =/etc/crontab=, a file that defines when automated jobs will run
  - =/etc/fstab=, a table of storage devices and their associated mount points1

* NFS
* LDAP
  | Attribute   | Stands for        | Description                                     |
  |-------------+-------------------+-------------------------------------------------|
  | o           | Organization      | Often identifies a site's top-level entry       |
  | ou          | Organization unit | A logical subdivision                           |
  | cn          | Common name       | The most natural name to represent the entry    |
  | dc          | Domain component  | Used at sites that model their hierarchy on DNS |
  | objectClass | Object class      | Schema to which this entry's attributes conform |

** openldap
   - command: *slapd*
   - cluster: *slurpd* (master server)
   - configuration: =/etc/openldap/slapd.conf=
     #+BEGIN_SRC conf
       database bdb # default: Berkely DB
       suffix "dc=mydomain,dc=com" # LDAP basename, like DNS domain name
       rootdn "cn=admin,dc=mydomain,dc=com" # administrator name
       rootpw {crypt}abcDEFg/uiR # hashed password
       directory /var/lib/ldap
     #+END_SRC
   - configuration: =/etc/openldap/lapd.conf=, set the /base/ to the same value as the suffix
     #+BEGIN_SRC conf
       BASE dc=mydomain,dc=com
       URI ldap://xxx.mydomain.com
     #+END_SRC

   - use *slappasswd* to change password

