os/linux.html

<div id="outline-container-org2c81e12" class="outline-3">
<h3 id="org2c81e12"><span class="section-number-3">6.3</span> File type</h3>
<div class="outline-text-3" id="text-6-3">
<ul class="org-ul">
<li><p>
investigating file type: <code>file</code> or <code>ls</code>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Symbol</th>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Created by</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">-</td>
<td class="org-left">regular file</td>
<td class="org-left">editors</td>
</tr>

<tr>
<td class="org-left">d</td>
<td class="org-left">directory</td>
<td class="org-left"><code>mkdir</code></td>
</tr>

<tr>
<td class="org-left">c</td>
<td class="org-left">character device file</td>
<td class="org-left"><code>mknod</code></td>
</tr>

<tr>
<td class="org-left">b</td>
<td class="org-left">block device file</td>
<td class="org-left"><code>mknod</code></td>
</tr>

<tr>
<td class="org-left">s</td>
<td class="org-left">domain socket</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">p</td>
<td class="org-left">named pipe</td>
<td class="org-left"><code>mknod</code></td>
</tr>

<tr>
<td class="org-left">l</td>
<td class="org-left">symbolic link</td>
<td class="org-left"><code>ln -s</code></td>
</tr>
</tbody>
</table></li>
</ul>
</div>
</div>

<div id="outline-container-orgbd22e03" class="outline-3">
<h3 id="orgbd22e03"><span class="section-number-3">6.4</span> Important Directories</h3>
<div class="outline-text-3" id="text-6-4">
<ul class="org-ul">
<li><code>man hier</code></li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><code>/bin</code></td>
<td class="org-left">Contains binaries (programs) that must be present for the system to boot and run.</td>
</tr>

<tr>
<td class="org-left"><code>/boot</code></td>
<td class="org-left">Contains the Linux kernel, initial RAM disk image, and the boot loader.</td>
</tr>

<tr>
<td class="org-left"><code>/dev</code></td>
<td class="org-left">This is a special directory that contains device nodes.</td>
</tr>

<tr>
<td class="org-left"><code>/etc</code></td>
<td class="org-left">Contains all of the system-wide configuration files.</td>
</tr>

<tr>
<td class="org-left"><code>/home</code></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>/lib</code></td>
<td class="org-left">Contains shared library files used by the core system programs.</td>
</tr>

<tr>
<td class="org-left"><code>/lost+found</code></td>
<td class="org-left">It is used in the case of a partial recovery from a filesystem corruption event.</td>
</tr>

<tr>
<td class="org-left"><code>/media</code></td>
<td class="org-left">Contain the mount points for removable media such as USB drives, CD-ROMs, etc.</td>
</tr>

<tr>
<td class="org-left"><code>/opt</code></td>
<td class="org-left">The <code>/opt</code> directory is used to install "optional" software. This is mainly used to hold commercial software products that may be installed on your system.</td>
</tr>

<tr>
<td class="org-left"><code>/proc</code></td>
<td class="org-left">It is a virtual filesystem maintained by the Linux kernel. The files are readable and will give you a picture of how the kernel sees your computer.</td>
</tr>

<tr>
<td class="org-left"><code>/root</code></td>
<td class="org-left">This is the home directory for the root account.</td>
</tr>

<tr>
<td class="org-left"><code>/sbin</code></td>
<td class="org-left">This directory contains 'system' binaries. These are programs that perform vital system tasks that are generally reserved for the superuser.</td>
</tr>

<tr>
<td class="org-left"><code>/tmp</code></td>
<td class="org-left">The <code>/tmp</code> directory is intended for storage of temporary, transient files created by various programs.</td>
</tr>

<tr>
<td class="org-left"><code>/usr</code></td>
<td class="org-left">The <code>/usr</code> directory tree is likely the largest one on a Linux system. It contains all the programs and support files used by regular users.</td>
</tr>

<tr>
<td class="org-left"><code>/usr/bin</code></td>
<td class="org-left">Contains the executable programs installed by your Linux distribution</td>
</tr>

<tr>
<td class="org-left"><code>/usr/lib</code></td>
<td class="org-left">The shared libraries for the programs in <code>/usr/bin</code>.</td>
</tr>

<tr>
<td class="org-left"><code>/usr/local</code></td>
<td class="org-left">The <code>/usr/local</code> tree is where programs that are not included with your distribution but are intended for system-wide use are installed.</td>
</tr>

<tr>
<td class="org-left"><code>/usr/sbin</code></td>
<td class="org-left">Contains more system administration programs.</td>
</tr>

<tr>
<td class="org-left"><code>/usr/share</code></td>
<td class="org-left">Contains all the shared data used by programs in <code>/usr/bin</code>.</td>
</tr>

<tr>
<td class="org-left"><code>/usr/share/doc</code></td>
<td class="org-left">Most packages installed on the system will include some kind of documentation.</td>
</tr>

<tr>
<td class="org-left"><code>/var</code></td>
<td class="org-left">The <code>/var</code> directory tree is where data that is likely to change is stored. Various databases, spool files, user mail, etc. are located here.</td>
</tr>

<tr>
<td class="org-left"><code>/var/log</code></td>
<td class="org-left">Contains log files, records of various system activity. These are very important and should be monitored from time to time. The most useful one is <code>/var/log/messages</code>.</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org6b9cd14" class="outline-3">
<h3 id="org6b9cd14"><span class="section-number-3">6.5</span> interesting files</h3>
<div class="outline-text-3" id="text-6-5">
<ul class="org-ul">
<li><code>/boot/grub/grub.cfg</code>, which are used to configure the boot loader</li>
<li><code>/boot/vmlinuz</code>, the Linux kernel</li>
<li><code>/etc/crontab</code>, a file that defines when automated jobs will run</li>
<li><code>/etc/fstab</code>, a table of storage devices and their associated mount points1</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgd28a46e" class="outline-2">
<h2 id="orgd28a46e"><span class="section-number-2">7</span> NFS</h2>
</div>
<div id="outline-container-org1ed2d69" class="outline-2">
<h2 id="org1ed2d69"><span class="section-number-2">8</span> LDAP</h2>
<div class="outline-text-2" id="text-8">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Attribute</th>
<th scope="col" class="org-left">Stands for</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">o</td>
<td class="org-left">Organization</td>
<td class="org-left">Often identifies a site's top-level entry</td>
</tr>

<tr>
<td class="org-left">ou</td>
<td class="org-left">Organization unit</td>
<td class="org-left">A logical subdivision</td>
</tr>

<tr>
<td class="org-left">cn</td>
<td class="org-left">Common name</td>
<td class="org-left">The most natural name to represent the entry</td>
</tr>

<tr>
<td class="org-left">dc</td>
<td class="org-left">Domain component</td>
<td class="org-left">Used at sites that model their hierarchy on DNS</td>
</tr>

<tr>
<td class="org-left">objectClass</td>
<td class="org-left">Object class</td>
<td class="org-left">Schema to which this entry's attributes conform</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-orgcd1ba77" class="outline-3">
<h3 id="orgcd1ba77"><span class="section-number-3">8.1</span> openldap</h3>
<div class="outline-text-3" id="text-8-1">
<ul class="org-ul">
<li>command: <b>slapd</b></li>
<li>cluster: <b>slurpd</b> (master server)</li>
<li><p>
configuration: <code>/etc/openldap/slapd.conf</code>
</p>
<div class="org-src-container">
<pre class="src src-conf">database bdb <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">default: Berkely DB</span>
suffix <span style="color: #2d9574;">"dc=mydomain,dc=com"</span> <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">LDAP basename, like DNS domain name</span>
rootdn <span style="color: #2d9574;">"cn=admin,dc=mydomain,dc=com"</span> <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">administrator name</span>
rootpw {crypt}abcDEFg/uiR <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">hashed password</span>
directory /var/lib/ldap
</pre>
</div></li>
<li><p>
configuration: <code>/etc/openldap/lapd.conf</code>, set the <i>base</i> to the same value as the suffix
</p>
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #715ab1;">BASE dc</span>=mydomain,dc=com
URI ldap://xxx.mydomain.com
</pre>
</div></li>

<li>use <b>slappasswd</b> to change password</li>
</ul>
</div>
</div>
