os/linux.html

<div id="outline-container-orga8353a2" class="outline-3">
<h3 id="orga8353a2"><span class="section-number-3">8.2</span> 389 Directory Server</h3>
<div class="outline-text-3" id="text-8-2">
<p>
Advantages:
</p>
<ul class="org-ul">
<li>Multimaster replication</li>
<li>Active Directory user and group synchronization</li>
<li>A graphical console for all facets of user, group, and server management</li>
</ul>
</div>
</div>

<div id="outline-container-org0f6f95b" class="outline-3">
<h3 id="org0f6f95b"><span class="section-number-3">8.3</span> phpLDAPadmin</h3>
</div>
<div id="outline-container-orga34d09d" class="outline-3">
<h3 id="orga34d09d"><span class="section-number-3">8.4</span> ldapsearch</h3>
<div class="outline-text-3" id="text-8-4">
<p>
command-line tool
</p>
</div>
</div>
</div>
<div id="outline-container-org51d05e8" class="outline-2">
<h2 id="org51d05e8"><span class="section-number-2">9</span> Networking</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-org0e61899" class="outline-3">
<h3 id="org0e61899"><span class="section-number-3">9.1</span> Troubleshooting</h3>
</div>
</div>
<div id="outline-container-org6805865" class="outline-2">
<h2 id="org6805865"><span class="section-number-2">10</span> Text Processing</h2>
<div class="outline-text-2" id="text-10">
<ul class="org-ul">
<li><code>cut</code>: separate lines into fields</li>
<li><code>sort</code>: sort lines</li>
<li><code>uniq</code>: print unique lines</li>
<li><code>wc</code>: count lines, words, and characters</li>
<li><code>tee</code>: copy input to two places</li>
</ul>
</div>
<div id="outline-container-orge2a1748" class="outline-3">
<h3 id="orge2a1748"><span class="section-number-3">10.1</span> grep</h3>
<div class="outline-text-3" id="text-10-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">-i, &#x2013;ignore-case</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">-v, &#x2013;invert-match</td>
<td class="org-left">Invert the sense of matching, to select non-matching lines.</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-orgb461ffa" class="outline-2">
<h2 id="orgb461ffa"><span class="section-number-2">11</span> Useful Command</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-org22be06f" class="outline-3">
<h3 id="org22be06f"><span class="section-number-3">11.1</span> os</h3>
<div class="outline-text-3" id="text-11-1">
<ul class="org-ul">
<li><code>uname -a</code></li>
<li><code>lsb_release -a</code></li>
</ul>
</div>
</div>
<div id="outline-container-orgabef194" class="outline-3">
<h3 id="orgabef194"><span class="section-number-3">11.2</span> File System</h3>
<div class="outline-text-3" id="text-11-2">
</div>
<div id="outline-container-org15e2884" class="outline-4">
<h4 id="org15e2884"><span class="section-number-4">11.2.1</span> <code>ls</code></h4>
<div class="outline-text-4" id="text-11-2-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">-a, &#x2013;all</td>
<td class="org-left">do not ignore entries starting with .</td>
</tr>

<tr>
<td class="org-left">-d, &#x2013;directory</td>
<td class="org-left">list directories themselves, not their contents</td>
</tr>

<tr>
<td class="org-left">-F, &#x2013;classify</td>
<td class="org-left">append indicator to entries</td>
</tr>

<tr>
<td class="org-left">-h, &#x2013;human-readable</td>
<td class="org-left">print human readable sizes</td>
</tr>

<tr>
<td class="org-left">-r, &#x2013;reverse</td>
<td class="org-left">reverse order while sorting</td>
</tr>

<tr>
<td class="org-left">-S</td>
<td class="org-left">sort by file size, largest first</td>
</tr>

<tr>
<td class="org-left">-t</td>
<td class="org-left">sort by modification time, newest first</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org0917974" class="outline-4">
<h4 id="org0917974"><span class="section-number-4">11.2.2</span> <code>file</code></h4>
<div class="outline-text-4" id="text-11-2-2">
<p>
determine file type
</p>
</div>
</div>
<div id="outline-container-org785e7b6" class="outline-4">
<h4 id="org785e7b6"><span class="section-number-4">11.2.3</span> <code>less</code>, <code>head</code>, <code>tail</code></h4>
</div>
<div id="outline-container-org1679ed8" class="outline-4">
<h4 id="org1679ed8"><span class="section-number-4">11.2.4</span> <code>mkdir</code></h4>
</div>
<div id="outline-container-org546c796" class="outline-4">
<h4 id="org546c796"><span class="section-number-4">11.2.5</span> <code>cp</code></h4>
<div class="outline-text-4" id="text-11-2-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">-a, &#x2013;archive</td>
<td class="org-left">Copy the files and directories and all of their attributes, including ownerships and permissions.</td>
</tr>

<tr>
<td class="org-left">-i, &#x2013;interactive</td>
<td class="org-left">Before overwriting an existing file, prompt the user for confirmation.</td>
</tr>

<tr>
<td class="org-left">-r, &#x2013;recursive</td>
<td class="org-left">Recursively copy directories and their contents.</td>
</tr>

<tr>
<td class="org-left">-u, &#x2013;update</td>
<td class="org-left">When copying files from one directory to another, copy only files that either don’t exist or are newer than the existing corresponding files in the destination directory.</td>
</tr>

<tr>
<td class="org-left">-v, &#x2013;verbose</td>
<td class="org-left">Display informative messages as the copy is performed.</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org0ed94a6" class="outline-4">
<h4 id="org0ed94a6"><span class="section-number-4">11.2.6</span> <code>mv</code></h4>
<div class="outline-text-4" id="text-11-2-6">
<p>
similar to cp, common options: -i, -u, -v
</p>
</div>
</div>

<div id="outline-container-orgdca872e" class="outline-4">
<h4 id="orgdca872e"><span class="section-number-4">11.2.7</span> <code>rm</code></h4>
<div class="outline-text-4" id="text-11-2-7">
<p>
similar to cp, common options: -i, -r, -v
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">-f, &#x2013;force</td>
<td class="org-left">Ignore nonexistent files and do not prompt. This overrides the &#x2013;interactive option.</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org0fa14fc" class="outline-4">
<h4 id="org0fa14fc"><span class="section-number-4">11.2.8</span> <code>ln</code></h4>
<div class="outline-text-4" id="text-11-2-8">
<ul class="org-ul">
<li>create soft link: <code>ln file link</code></li>
<li>create hard link: <code>ln -s item link</code></li>
</ul>
</div>
<ul class="org-ul">
<li><a id="org84e622b"></a>hard link limitation<br />
<div class="outline-text-5" id="text-org84e622b">
<ul class="org-ul">
<li>A hard link cannot reference a file outside its own filesystem. This means a link</li>
</ul>
<p>
cannot reference a file that is not on the same disk partition as the link itself.
</p>
<ul class="org-ul">
<li>A hard link cannot reference a directory.</li>
</ul>
</div>
</li>
</ul>
</div>

<div id="outline-container-orgd49d5d0" class="outline-4">
<h4 id="orgd49d5d0"><span class="section-number-4">11.2.9</span> GLOB pattern</h4>
<div class="outline-text-4" id="text-11-2-9">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Wildcard</th>
<th scope="col" class="org-left">Matches</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>*</code></td>
<td class="org-left">Any characters</td>
</tr>

<tr>
<td class="org-left"><code>?</code></td>
<td class="org-left">Any single character</td>
</tr>

<tr>
<td class="org-left"><code>[characters]</code></td>
<td class="org-left">Any character that is a member of the set <code>characters</code></td>
</tr>

<tr>
<td class="org-left"><code>[!characters]</code></td>
<td class="org-left">Any character that is not a member of the set characters</td>
</tr>

<tr>
<td class="org-left"><code>[CLASS]</code></td>
<td class="org-left">Any character that is a member of the specified class</td>
</tr>
</tbody>
</table>
</div>

<ul class="org-ul">
<li><a id="orgf63d910"></a>most commonly used character classes<br />
<div class="outline-text-5" id="text-orgf63d910">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><code>[:alnum:]</code></td>
<td class="org-left">Any alphanumeric character</td>
</tr>

<tr>
<td class="org-left"><code>[:alpha:]</code></td>
<td class="org-left">Any alphabetic character</td>
</tr>

<tr>
<td class="org-left"><code>[:digit:]</code></td>
<td class="org-left">Any numeral</td>
</tr>

<tr>
<td class="org-left"><code>[:lower:]</code></td>
<td class="org-left">Any lowercase letter</td>
</tr>

<tr>
<td class="org-left"><code>[:upper:]</code></td>
<td class="org-left">Any uppercase letter</td>
</tr>
</tbody>
</table>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgf0cf0ea" class="outline-3">
<h3 id="orgf0cf0ea"><span class="section-number-3">11.3</span> Command Related</h3>
<div class="outline-text-3" id="text-11-3">
<ul class="org-ul">
<li><code>which</code>: Display which executable program will be executed.</li>
<li><code>man</code>: Display a command’s manual page.</li>
<li><code>apropos</code>: Display a list of appropriate commands. same as <code>man -k</code></li>
<li><code>info</code>: Display a command’s info entry.</li>
<li><code>whatis</code>: Display a very brief description of a command.</li>
</ul>
</div>

<div id="outline-container-org96604d7" class="outline-4">
<h4 id="org96604d7"><span class="section-number-4">11.3.1</span> <code>type</code></h4>
<div class="outline-text-4" id="text-11-3-1">
<p>
Indicate how a command name is interpreted. All types:
</p>
<ul class="org-ul">
<li>An executable program</li>
<li>A command built into the shell itself(e.g. cd)</li>
<li>A shell function</li>
<li>An alias(e.g. ls)</li>
</ul>
</div>
</div>

<div id="outline-container-org3ce5754" class="outline-4">
<h4 id="org3ce5754"><span class="section-number-4">11.3.2</span> <code>alias</code></h4>
<div class="outline-text-4" id="text-11-3-2">
<p>
Create an alias for a command.
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #3a81c3;">alias</span> <span style="color: #715ab1;">foo</span>=<span style="color: #2d9574;">'cd /usr; ls; cd -'</span>
<span style="color: #3a81c3;">alias</span> <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">list all aliases</span>
</pre>
</div>
</div>
</div>
</div>
