os/linux.html

<div id="outline-container-orgf498816" class="outline-3">
<h3 id="orgf498816"><span class="section-number-3">11.4</span> Redirection</h3>
<div class="outline-text-3" id="text-11-4">
</div>
<div id="outline-container-org65283e5" class="outline-4">
<h4 id="org65283e5"><span class="section-number-4">11.4.1</span> Redirecting stdout and stderr to one file</h4>
<div class="outline-text-4" id="text-11-4-1">
<div class="org-src-container">
<pre class="src src-sh">some-command &gt; output.txt 2&gt;&amp;1 <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">old version, the order of the redirections is s</span><span style="color: #6c4173; background-color: #ecf3ec;">ignificant.</span>
some-command &amp;&gt; output.txt
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgca250fb" class="outline-3">
<h3 id="orgca250fb"><span class="section-number-3">11.5</span> Expansion</h3>
<div class="outline-text-3" id="text-11-5">
</div>
<div id="outline-container-org4d2815b" class="outline-4">
<h4 id="org4d2815b"><span class="section-number-4">11.5.1</span> Arithmetic Expansion</h4>
<div class="outline-text-4" id="text-11-5-1">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #3a81c3;">echo</span> $((2 + 2))
</pre>
</div>
</div>
</div>

<div id="outline-container-orge680348" class="outline-4">
<h4 id="orge680348"><span class="section-number-4">11.5.2</span> Brace Expansion</h4>
<div class="outline-text-4" id="text-11-5-2">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #3a81c3;">echo</span> Number_{1..5}
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">=&gt; Number_1 Number_2 Number_3 Number_4 Number_5</span>

<span style="color: #3a81c3;">echo</span> {Z..A}
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">=&gt; Z Y X W V U T S R Q P O N M L K J I H G F E D C B A</span>

<span style="color: #3a81c3;">echo</span> a{A{1,2},B{3,4}}b
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">=&gt; aA1b aA2b aB3b aB4b</span>

mkdir {2009..2011}-0{1..9} {2009..2011}-{10..12}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd5a29ff" class="outline-4">
<h4 id="orgd5a29ff"><span class="section-number-4">11.5.3</span> Command Substitution</h4>
<div class="outline-text-4" id="text-11-5-3">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #3a81c3;">echo</span> $(ls)
ls -l $(<span style="color: #3a81c3;">which</span> cp)
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">same as</span>
ls -l <span style="color: #ff00ff;">`which cp`</span> <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">old syntax</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org181783e" class="outline-4">
<h4 id="org181783e"><span class="section-number-4">11.5.4</span> Quoting</h4>
<div class="outline-text-4" id="text-11-5-4">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #3a81c3;">echo</span> text ~/*.txt {a,b} $(<span style="color: #3a81c3;">echo</span> foo) $((2+2)) $<span style="color: #715ab1;">USER</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">=&gt; text /home/me/ls-output.txt a b foo 4 me</span>

<span style="color: #3a81c3;">echo</span> <span style="color: #2d9574;">"text &#732;/*.txt {a,b} $(echo foo) $((2+2)) $USER"</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">=&gt; text &#732;/*.txt {a,b} foo 4 me</span>

<span style="color: #3a81c3;">echo</span> <span style="color: #2d9574;">'text &#732;/*.txt {a,b} $(echo foo) $((2+2)) $USER'</span> <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">suppress all expansions</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">=&gt; text &#732;/*.txt {a,b} $(echo foo) $((2+2)) $USER</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org48357f5" class="outline-4">
<h4 id="org48357f5"><span class="section-number-4">11.5.5</span> Escaping Characters</h4>
<div class="outline-text-4" id="text-11-5-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">\a</td>
<td class="org-left">Beep</td>
</tr>

<tr>
<td class="org-left">\b</td>
<td class="org-left">Backspace</td>
</tr>

<tr>
<td class="org-left">\n</td>
<td class="org-left">Newline</td>
</tr>

<tr>
<td class="org-left">\r</td>
<td class="org-left">Carriage return</td>
</tr>

<tr>
<td class="org-left">\t</td>
<td class="org-left">Tab</td>
</tr>
</tbody>
</table>
<div class="org-src-container">
<pre class="src src-sh">sleep 10; <span style="color: #3a81c3;">echo</span> -e  <span style="color: #2d9574;">"Time's up\a"</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">or</span>
sleep 10; <span style="color: #3a81c3;">echo</span> <span style="color: #2d9574;">"Time's up"</span> $<span style="color: #2d9574;">'\a'</span>
</pre>
</div>
</div>
</div>
</div>
</div>
